In [2]:
import pandas as pd
import numpy as np

import seaborn as sns
import matplotlib.pyplot as plt
from matplotlib.colors import ListedColormap
from mpl_toolkits.mplot3d import Axes3D

from sklearn.preprocessing import LabelEncoder
from sklearn.preprocessing import MinMaxScaler , StandardScaler


from sklearn.decomposition import PCA
from yellowbrick.cluster import KElbowVisualizer
from sklearn.cluster import KMeans
from sklearn.cluster import AgglomerativeClustering

In [3]:
account_df = pd.read_csv('czech-financial-dataset/data/account.csv')
print("number of rows", len(account_df))
account_df.head(20)

number of rows 4500

    account_id  district_id           frequency    date
0          576           55    POPLATEK MESICNE  930101
1         3818           74    POPLATEK MESICNE  930101
2          704           55    POPLATEK MESICNE  930101
3         2378           16    POPLATEK MESICNE  930101
4         2632           24    POPLATEK MESICNE  930102
5         1972           77    POPLATEK MESICNE  930102
6         1539            1  POPLATEK PO OBRATU  930103
7          793           47    POPLATEK MESICNE  930103
8         2484           74    POPLATEK MESICNE  930103
9         1695           76    POPLATEK MESICNE  930103
10        1726           48    POPLATEK MESICNE  930103
11        2881           70    POPLATEK MESICNE  930104
12        2357           19    POPLATEK MESICNE  930104
13        2177           62    POPLATEK MESICNE  930104
14         485            6  POPLATEK PO OBRATU  930104
15         652           21    POPLATEK MESICNE  930105
16        9635           70    POPLATEK MESICNE  930105
17        1844           44    POPLATEK MESICNE  930106
18        1926           37    POPLATEK MESICNE  930106
19        2393           10    POPLATEK MESICNE  930107

In [4]:
account_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4500 entries, 0 to 4499
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   account_id   4500 non-null   int64
 1   district_id  4500 non-null   int64
 2   frequency    4500 non-null   object
 3   date         4500 non-null   int64
dtypes: int64(3), object(1)
memory usage: 140.8+ KB

In [5]:
trans_df = pd.read_csv('czech-financial-dataset/data/trans.csv')
print("number of rows", len(trans_df))
trans_df.head(20)

C:\Users\hazir\AppData\Local\Temp\ipykernel_13984\733682222.py:1: DtypeWarning: Columns (8) have mixed types. Specify dtype option on import or set low_memory=False.
  trans_df = pd.read_csv('czech-financial-dataset/data/trans.csv')

number of rows 1056320

,trans_id,account_id,date,type,operation,amount,balance,k_symbol,bank,account
0,695247,2378,930101,PRIJEM,VKLAD,700.0,700.0,NaN,NaN,NaN
1,171812,576,930101,PRIJEM,VKLAD,900.0,900.0,NaN,NaN,NaN
2,207264,704,930101,PRIJEM,VKLAD,1000.0,1000.0,NaN,NaN,NaN
3,1117247,3818,930101,PRIJEM,VKLAD,600.0,600.0,NaN,NaN,NaN
4,579373,1972,930102,PRIJEM,VKLAD,400.0,400.0,NaN,NaN,NaN
5,771035,2632,930102,PRIJEM,VKLAD,1100.0,1100.0,NaN,NaN,NaN
6,452728,1539,930103,PRIJEM,VKLAD,600.0,600.0,NaN,NaN,NaN
7,725751,2484,930103,PRIJEM,VKLAD,1100.0,1100.0,NaN,NaN,NaN
8,497211,1695,930103,PRIJEM,VKLAD,200.0,200.0,NaN,NaN,NaN
9,232960,793,930103,PRIJEM,VKLAD,800.0,800.0,NaN,NaN,NaN
10,505240,1726,930103,PRIJEM,VKLAD,1000.0,1000.0,NaN,NaN,NaN
11,144541,485,930104,PRIJEM,VKLAD,300.0,300.0,NaN,NaN,NaN
12,637741,2177,930104,PRIJEM,VKLAD,800.0,800.0,NaN,NaN,NaN
13,689827,2357,930104,PRIJEM,VKLAD,800.0,800.0,NaN,NaN,NaN
14,846006,2881,930104,PRIJEM,VKLAD,700.0,700.0,NaN,NaN,NaN
15,637742,2177,930105,PRIJEM,PREVOD Z UCTU,5123.0,5923.0,DUCHOD,YZ,62457513.0
16,2908688,9635,930105,PRIJEM,VKLAD,400.0,400.0,NaN,NaN,NaN
17,232961,793,930105,PRIJEM,PREVOD Z UCTU,3401.0,4201.0,NaN,IJ,6149286.0
18,192096,652,930105,PRIJEM,VKLAD,700.0,700.0,NaN,NaN,NaN
19,542215,1844,930106,PRIJEM,VKLAD,500.0,500.0,NaN,NaN,NaN

In [6]:
trans_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1056320 entries, 0 to 1056319
Data columns (total 10 columns):
 #   Column      Non-Null Count    Dtype
---  ------      --------------    -----
 0   trans_id    1056320 non-null  int64
 1   account_id  1056320 non-null  int64
 2   date        1056320 non-null  int64
 3   type        1056320 non-null  object
 4   operation   873206 non-null   object
 5   amount      1056320 non-null  float64
 6   balance     1056320 non-null  float64
 7   k_symbol    574439 non-null   object
 8   bank        273508 non-null   object
 9   account     295389 non-null   float64
dtypes: float64(3), int64(3), object(4)
memory usage: 80.6+ MB

In [7]:
loan_df = pd.read_csv('czech-financial-dataset/data/loan.csv')
print("number of rows", len(loan_df))
loan_df.head(20)

number of rows 682

    loan_id  account_id    date  amount  duration  payments status
0      5314        1787  930705   96396        12    8033.0      B
1      5316        1801  930711  165960        36    4610.0      A
2      6863        9188  930728  127080        60    2118.0      A
3      5325        1843  930803  105804        36    2939.0      A
4      7240       11013  930906  274740        60    4579.0      A
5      6687        8261  930913   87840        24    3660.0      A
6      7284       11265  930915   52788        12    4399.0      A
7      6111        5428  930924  174744        24    7281.0      B
8      7235       10973  931013  154416        48    3217.0      A
9      5997        4894  931104  117024        24    4876.0      A
10     7121       10364  931110   21924        36     609.0      A
11     6077        5270  931122   79608        24    3317.0      A
12     6228        6034  931201  464520        60    7742.0      B
13     6356        6701  931208   95400        36    2650.0      A
14     5523        2705  931208   93888        36    2608.0      A
15     6456        7123  931209   47016        12    3918.0      A
16     7104       10320  931213  259740        60    4329.0      A
17     6820        9034  931216   38148        12    3179.0      A
18     6876        9236  931221   86616        12    7218.0      A
19     7097       10266  931223   75624        24    3151.0      B

In [8]:
loan_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 682 entries, 0 to 681
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   loan_id     682 non-null    int64
 1   account_id  682 non-null    int64
 2   date        682 non-null    int64
 3   amount      682 non-null    int64
 4   duration    682 non-null    int64
 5   payments    682 non-null    float64
 6   status      682 non-null    object
dtypes: float64(1), int64(5), object(1)
memory usage: 37.4+ KB

In [12]:
disp_df = pd.read_csv('czech-financial-dataset/data/disp.csv')
print("number of rows", len(disp_df))
disp_df.head()

number of rows 5369

   disp_id  client_id  account_id       type
0        1          1           1      OWNER
1        2          2           2      OWNER
2        3          3           2  DISPONENT
3        4          4           3      OWNER
4        5          5           3  DISPONENT

In [ ]:
#rename columns
disp_df = disp_df.rename(columns={'Type': 'DispType'})

In [10]:
disp_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5369 entries, 0 to 5368
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   disp_id     5369 non-null   int64
 1   client_id   5369 non-null   int64
 2   account_id  5369 non-null   int64
 3   type        5369 non-null   object
dtypes: int64(3), object(1)
memory usage: 167.9+ KB

In [11]:
card_df = pd.read_csv('czech-financial-dataset/data/card.csv')
print("number of rows", len(card_df))
card_df.head(20)

number of rows 892

    card_id  disp_id     type           issued
0      1005     9285  classic  931107 00:00:00
1       104      588  classic  940119 00:00:00
2       747     4915  classic  940205 00:00:00
3        70      439  classic  940208 00:00:00
4       577     3687  classic  940215 00:00:00
5       377     2429  classic  940303 00:00:00
6       721     4680   junior  940405 00:00:00
7       437     2762  classic  940601 00:00:00
8       188     1146  classic  940619 00:00:00
9        13       87  classic  940629 00:00:00
10      732     4763  classic  940721 00:00:00
11      181     1066  classic  940819 00:00:00
12      384     2475   junior  940915 00:00:00
13      309     1946  classic  940919 00:00:00
14      478     3084  classic  941009 00:00:00
15      563     3589  classic  941021 00:00:00
16      369     2363  classic  941108 00:00:00
17      376     2428  classic  941110 00:00:00
18      483     3115  classic  941124 00:00:00
19      174     1039   junior  941204 00:00:00

In [ ]:
card_df.info()

account data cleaning

In [ ]:
#rename columns
account_df = account_df.rename(columns={'frequency': 'AcctFeeType', 'date':'AcctCreateDate'})

#Change the czech terms into english
mapping = {'POPLATEK MESICNE':'fee per month', 'POPLATEK PO OBRATU':'fee per transaction', 'POPLATEK TYDNE':'fee per week'}
account_df['AcctFeeType'] = account_df['AcctFeeType'].replace(mapping)

#Changing the date column into DateTime Object
#account_df['AcctCreateDate'] = pd.to_datetime(account_df['AcctCreateDate'], format='%y%m%d')

transaction data cleaning

In [ ]:
#drop columns
drop_cols = [
    'k_symbol',
    'bank',
    'account'
]
trans_df = trans_df.drop(drop_cols, axis=1)

#remove missing values
trans_df.dropna(subset=['operation'], inplace=True)

#rename columns
trans_df = trans_df.rename(columns={'type': 'TransType', 'operation': 'TransOp','date':'TransDate'})

#Change the czech terms into english
mapping = {'PRIJEM':'INCOME', 'VYDAJ':'EXPENSE', 'VYBER':'WITHDRAWAL'}
mapping2 = {'VKLAD': 'depositing money', 'PREVOD Z UCTU':'transfer from account', 'VYBER':'withdrawing money', 
            'PREVOD NA UCET':'transfer to account','VYBER KARTOU':'withdrawing by card'}
trans_df['TransType'] = trans_df['TransType'].replace(mapping)
trans_df['TransOp'] = trans_df['TransOp'].replace(mapping2)

#Changing the date column into DateTime Object
trans_df['TransDate'] = pd.to_datetime(trans_df['TransDate'], format='%y%m%d')

loan data cleaning

In [ ]:
#drop columns
drop_cols = [
    'loan_id' #every loan_id and account_id is unique we do not need loan id 
]
loan_df = loan_df.drop(drop_cols, axis=1)

#remove missing values
loan_df = loan_df.dropna() #no missing values
print("number of rows", len(loan_df))

#rename columns
loan_df = loan_df.rename(columns={'date': 'LoanStartDate'})

#Changing the date column into DateTime Object
loan_df['LoanStartDate'] = pd.to_datetime(loan_df['LoanStartDate'], format='%y%m%d')

disposition data cleaning